{
    "auto_mapping": null,
    "base_model_name_or_path": "PKU-Alignment/alpaca-7b-reproduced",
    "bias": "none",
    "fan_in_fan_out": false,
    "inference_mode": true,
    "layers_pattern": null,
    "layers_to_transform": null,
    "lora_alpha": 8.0,
    "lora_dropout": 0.05,
    "modules_to_save": null,
    "obj_num": 2,
    "peft_type": "PBLORA",
    "pref_vec_init": [
        0.5,
        0.5
    ],
    "r1": 4,
    "r2": 4,
    "revision": null,
    "target_modules": [
        "k_proj",
        "v_proj",
        "q_proj"
    ],
    "task_type": "CAUSAL_LM"
}