{
    "auto_mapping": null,
    "base_model_name_or_path": "TinyLlama/TinyLlama-1.1B-Chat-v1.0",
    "bias": "none",
    "fan_in_fan_out": false,
    "inference_mode": true,
    "layers_pattern": null,
    "layers_to_transform": null,
    "lora_alpha": 8.0,
    "lora_dropout": 0.05,
    "modules_to_save": null,
    "obj_num": 3,
    "peft_type": "PBLORA",
    "pref_vec_init": [
        0.3,
        0.7,
        0.0
    ],
    "r1": 4,
    "r2": 4,
    "revision": null,
    "target_modules": [
        "q_proj",
        "v_proj",
        "k_proj"
    ],
    "task_type": "CAUSAL_LM"
}